📄 Extracted from page: PEBC eligibility criteria document evaluation language requirements pharmacy degree - Google Search
URL: https://www.google.com/search?q=PEBC+eligibility+criteria+document+evaluation+language+requirements+pharmacy+degree

Extracted content:
```json
{
  "title": "PEBC eligibility criteria document evaluation language requirements pharmacy degree - Google Search",
  "url": "https://www.google.com/search?q=PEBC+eligibility+criteria+document+evaluation+language+requirements+pharmacy+degree",
  "summary": "To become a certified pharmacist in Canada as an international pharmacy graduate, several key requirements must be met, primarily overseen by the Pharmacy Examining Board of Canada (PEBC). Applicants must possess a minimum four-year undergraduate pharmacy degree from a recognized university and register with Pharmacists' Gateway Canada before starting the document evaluation process. The PEBC evaluates academic and professional credentials to ensure they are comparable to Canadian standards. While PEBC itself does not require an English language proficiency test for the document evaluation stage, candidates must satisfy language requirements for Canadian immigration and provincial licensing. A common standard is an IELTS Academic score of 7.0 overall with no band below 6.5, though other tests like OET may be accepted, and provincial requirements can vary. Beyond document evaluation, the certification pathway typically includes passing the PEBC Qualifying Examination (which, for some, has seen changes like the removal of the Evaluating Exam in 2025), completing a practical training period or internship, and successfully passing a provincial law exam. PEBC does not mandate prior professional experience for document evaluation, nor is it strictly required to be registered in one's home country, provided an explanation is given.",
  "key_points": [
    "**Pharmacy Degree Requirement:** A minimum of a four-year undergraduate degree in pharmacy from a recognized university is mandatory.",
    "**Document Evaluation Process:** Academic and professional credentials must be submitted to PEBC for evaluation to ensure comparability to a Canadian-accredited pharmacy program. Required documents include academic transcripts, degree certificates, and identification.",
    "**Pharmacists' Gateway Canada:** Applicants must register with Pharmacists' Gateway Canada before submitting their application for document evaluation.",
    "**PEBC Language Requirement (for document evaluation):** PEBC itself does not require an English language test for the document evaluation stage.",
    "**Language Requirements (for Licensing & Immigration):** Candidates must meet language proficiency requirements for Canadian immigration and provincial licensing.",
    "**IELTS Requirement:** A common requirement is an IELTS Academic with an overall score of 7.0 and no individual band score below 6.5. Some provincial licensing bodies may have different or higher requirements.",
    "**Other Accepted English Tests:** Other tests, such as the OET, may also be accepted.",
    "**No Experience Requirement for Document Evaluation:** PEBC does not require prior professional experience for the document evaluation phase.",
    "**Home Country Licensing:** It is not mandatory to be a registered pharmacist in the home country, but applicants must be able to explain why if not.",
    "**Further Certification Steps:** After document evaluation and potentially the PEBC Qualifying Examination (consisting of two parts; changes to the Evaluating Exam are noted for 2025), candidates must complete a practical training period (internship) and pass a provincial law exam to meet full licensing requirements."
  ],
  "relevant_links": [
    "https://pebc.ca/pharmacists/document-evaluation/applying-for-document-evaluation/",
    "https://pebc.ca/pharmacists/document-evaluation/general-information/",
    "https://edgeplus.ca/pebc-english-language/",
    "https://www.pharmacists.ca/pharmacy-in-canada/becoming-a-pharmacist-in-canada/",
    "https://www.pharmacistsgatewaycanada.ca/before-you-start/pebc-certificate-of-qualification/",
    "https://academically.com/blogs/top-10-faqs-about-the-pebc-exam/",
    "https://www.eliteexpertise.com.au/canadian-pharmacist-pebc-exams-top-frequently-asked-questions",
    "https://mypharmavision.com/pharmacy-exams/pebc/pebc-exam-pharmacy-examining-board-of-canada/"
  ],
  "file_name": "pebc_pharmacy_certification_requirements.json"
}
```
