📄 Extracted from page: "PEBC qualifying exam" MCQ OSCE structure requirements passing scores - Google Search
URL: https://www.google.com/search?q=%22PEBC+qualifying+exam%22+MCQ+OSCE+structure+requirements+passing+scores

Extracted content:
```json
{
    "title": "PEBC qualifying exam\" MCQ OSCE structure requirements passing scores - Google Search",
    "url": "https://www.google.com/search?q=%22PEBC+qualifying+exam%22+MCQ+OSCE+structure+requirements+passing+scores",
    "summary": "The PEBC (Pharmacy Examining Board of Canada) Qualifying Exam is a mandatory two-part assessment for pharmacists seeking licensure in Canada, following the completion of the Evaluating Exam and a bridging course. It comprises Part I, a computer-based Multiple Choice Questions (MCQ) exam, and Part II, an Objective Structured Clinical Examination (OSCE). Both parts must be passed independently, with results reported as \"Pass/Fail\". Candidates are allowed a maximum of three attempts for each part, with remediation required before a fourth (final) attempt.",
    "key_points": [
        "**Overall Examination Structure:** The PEBC Qualifying Exam is the second stage of licensure in Canada, consisting of two main parts: Part I (MCQ) and Part II (OSCE). It is taken after the PEBC Evaluating Exam.",
        "**Part I: MCQ (Multiple Choice Questions) Exam:**",
        "   - **Format:** Computer-based examination.",
        "   - **Questions:** 200 multiple-choice questions, divided into two sections of 100 questions each.",
        "   - **Duration:** 4.25 hours, which includes time for orientation and a post-exam survey.",
        "**Part II: OSCE (Objective Structured Clinical Examination) Exam:**",
        "   - **Format:** In-person, case-study-based examination with various stations.",
        "   - **Station Types:** Includes both interactive stations (involving role-playing with standardized patients, caregivers, or other healthcare professionals) and non-interactive stations (requiring written responses, prescription checks, or other documentation tasks).",
        "   - **Duration:** Conducted in two halves, each lasting 90 minutes, separated by a 20-minute break.",
        "**Passing Scores:**",
        "   - Results for both Part I and Part II of the Qualifying Exam are reported as \"Pass/Fail\".",
        "   - Each part must be passed independently.",
        "   - Note: While the Qualifying Exam is Pass/Fail, the separate Pharmacist Evaluating Examination previously cited a pass mark of 60%.",
        "**Requirements and Attempts:**",
        "   - Candidates are permitted a maximum of three attempts for each individual exam part (Part I and Part II).",
        "   - A total of nine attempts is allowed across both parts.",
        "   - Should a candidate fail an exam part three times, remediation is required before they can attempt it a fourth (final) time.",
        "**Scheduling:** The Part I and Part II exams are typically held in May."
    ],
    "relevant_links": [
        "https://eliteexpertise.com/blog/pebc-qualifying-exam-2025/",
        "https://pebc.ca/faq/",
        "https://shkoh.com/pebc-osce-exam-preparation-structure-sample-scenarios-and-study-strategies/",
        "https://solrx.ca/preparing-for-the-pebc-mcq-exam-key-takeaways-from-our-student-info-session/",
        "https://mypharmavision.com/all-blog/comprehensive-pharmacy-guide-pebc-pharmacist-licensing-exam-of-canada/"
    ],
    "file_name": "pebc_qualifying_exam_info.json"
}
```
