📄 Extracted from page: PEBC evaluating exam international pharmacy graduates requirements - Google Search
URL: https://www.google.com/search?q=PEBC+evaluating+exam+international+pharmacy+graduates+requirements

Extracted content:
```json
{
  "title": "PEBC evaluating exam international pharmacy graduates requirements - Google Search",
  "url": "https://www.google.com/search?q=PEBC+evaluating+exam+international+pharmacy+graduates+requirements",
  "summary": "The Pharmacy Examining Board of Canada (PEBC) has updated its requirements for International Pharmacy Graduates (IPGs), significantly impacting the Evaluating Exam (EE). Effective in 2025, a new streamlined pathway allows graduates from ACPE- or CCAPP-accredited programs to bypass the Evaluating Exam and directly apply for the Qualifying Exam (MCQ and OSCE), following successful Document Evaluation. IPGs whose degrees are not from these accredited programs must still complete a Document Evaluation, pass the Evaluating Exam, and then proceed to the two-part Qualifying Exam. All candidates are required to hold a recognized pharmacy degree and must meet provincial language proficiency and other regulatory requirements.",
  "key_points": [
    "**Streamlined Pathway (Effective 2025)**: International Pharmacy Graduates from ACPE or CCAPP-accredited institutions are exempt from the Evaluating Exam.",
    "**Standard Pathway**: Graduates not from ACPE or CCAPP-accredited programs must complete the following steps: Document Evaluation, Evaluating Exam, and then the Qualifying Exam.",
    "**Document Evaluation**: Required for all IPGs to assess the equivalency of their pharmacy degree (academic transcripts, degree certificates, identification documents are submitted).",
    "**Evaluating Exam (EE)**: If applicable (for non-accredited program graduates), this exam must be passed before proceeding to the Qualifying Exam.",
    "**Qualifying Exam (Parts I and II)**: All IPGs, regardless of pathway, must pass this exam after successful document evaluation (and EE if applicable). It consists of a Multiple-Choice Questions (MCQ) exam and an Objective Structured Clinical Examination (OSCE).",
    "**General Requirements (All Candidates)**: Must hold a recognized pharmacy degree (e.g., BPharm, MPharm, PharmD).",
    "**Language Proficiency**: PEBC does not have its own language requirements, but candidates must meet the language proficiency standards of the specific provincial regulatory authority they apply to.",
    "**Other Provincial Requirements**: May include internship training and a clean criminal record.",
    "**Assessment Criteria**: Passing each stage (Document Evaluation, Evaluating Exam if applicable, and both parts of the Qualifying Exam) is required to progress in the certification process."
  ],
  "relevant_links": [
    "https://pebc.ca/pharmacists/certification-pathway/international-graduates/",
    "https://pebc.ca/streamlined_pathway_ipg/",
    "https://pebc.ca/pharmacists/document-evaluation/general-information/",
    "https://pebc.ca/pharmacists/pharmacist-evaluating-examination/general-information/",
    "https://www.bcpharmacists.org/news/new-pathway-eligible-international-pharmacy-graduates",
    "https://www.canadaqbank.com/blog/2025/09/18/pebc-2025-update-new-pathway-for-international-pharmacy-graduates/",
    "https://academically.com/blogs/pebc-canada-2025-update-no-evaluating-exam-needed/"
  ],
  "file_name": "pebc_evaluating_exam_ipg_requirements.json"
}
```
